In [4]:
import pandas as pd

# Customer list Table

In [17]:
#importing the customerlist table
custlist_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx", 
                   sheet_name='NewCustomerList')
custlist_df.sample(5)

C:\Users\kibe\AppData\Local\Temp\ipykernel_11356\883921910.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  custlist_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx",

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
705,Cissiee,Baylis,Female,99,1951-07-22,Cost Accountant,Financial Services,High Net Worth,N,No,...,NSW,Australia,11,0.89,0.8900,1.1125,1.11250,700,700,0.687500
226,Hatti,Carletti,U,35,NaT,Legal Assistant,IT,Affluent Customer,N,Yes,...,NSW,Australia,9,0.60,0.7500,0.9375,0.93750,226,226,1.112500
327,Aldridge,Poskitt,Male,84,1982-02-10,VP Sales,NaN,Mass Customer,N,No,...,QLD,Australia,5,0.62,0.6200,0.7750,0.65875,326,326,1.009375
482,Tina,Dunstan,Female,13,1939-03-06,Account Representative IV,Retail,Affluent Customer,N,No,...,NSW,Australia,7,1.03,1.0300,1.0300,1.03000,483,483,0.876563
781,Pansie,Beccero,Female,35,1964-07-07,Software Test Engineer I,Financial Services,Affluent Customer,N,Yes,...,QLD,Australia,5,0.51,0.6375,0.6375,0.63750,782,782,0.620500

In [18]:
custlist_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [19]:
custlist_df.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [23]:
custlist_df.sort_values( by="DOB",ascending=True,inplace=True)
custlist_df['DOB'].head(5)

797   1938-06-08
885   1938-06-09
769   1938-08-05
585   1938-08-30
265   1938-08-31
Name: DOB, dtype: datetime64[ns]

In [27]:
#to find entries that are neither male or female
either_male_or_female = custlist_df['gender'].isin(['Male', 'Female'])
#print(not_male_or_female)
result = either_male_or_female.sum()
print(result)

983

In [43]:
num_duplicate_rows = custlist_df.duplicated().sum()
num_duplicate_rows

0

<b>Data Quality Issues</b>
The table has missing values in some columns and some columns with no entries

# Customer Demographic table

In [29]:
custdemograph_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx", 
                   sheet_name='CustomerDemographic')
custdemograph_df.sample(5)

C:\Users\kibe\AppData\Local\Temp\ipykernel_11356\3476565140.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  custdemograph_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx",

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
1422,1423,Tiphanie,Klossek,Female,51,1959-06-17,Project Manager,Manufacturing,Mass Customer,N,ã»(ï¿£âï¿£)ã»:*:,No,19.0
400,401,Halette,Helling,Female,56,1986-12-11,Assistant Professor,Retail,Mass Customer,N,â¡,No,15.0
1469,1470,Albie,Pach,Male,62,1995-12-04,Senior Cost Accountant,Financial Services,High Net Worth,N,"×Ö¼Ö°×¨Öµ××©×Ö´××ª, ×Ö¼Ö¸×¨Ö¸× ×Ö±×Ö¹×Ö´××, ×Ö...",Yes,8.0
3948,3949,Costa,Sleightholm,Male,24,2001-12-19,Web Designer IV,Manufacturing,High Net Worth,N,-0.5,Yes,1.0
3389,3390,Fayth,Baudins,Female,20,1969-01-27,NaN,NaN,High Net Worth,N,â£,No,7.0

In [30]:
custdemograph_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [31]:
custdemograph_df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [32]:
custdemograph_df.sort_values( by="DOB",ascending=True,inplace=True)
custdemograph_df['DOB'].head(5)

33     1843-12-21
719    1931-10-23
1091   1935-08-22
3409   1940-09-22
2412   1943-08-11
Name: DOB, dtype: datetime64[ns]

In [33]:
eithermale_or_female = custdemograph_df['gender'].isin(['Male', 'Female'])
#print(not_male_or_female)
result = eithermale_or_female.sum()
print(result)

3909

In [46]:
num_duplicate_rows = custdemograph_df.duplicated().sum()
num_duplicate_rows

0

In [49]:
num_unique_values = custdemograph_df['customer_id'].nunique()
print("Number of unique values in column 'A': ", num_unique_values)

Number of unique values in column 'A':  4000

<b>Data Quality Issues</b> The table has missing values in some columns and incorrect format of data in the gender column.

# Customer address Table

In [35]:
custaddrs_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx", 
                   sheet_name='CustomerAddress')
custaddrs_df.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [36]:
custaddrs_df .info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [44]:
num_duplicate_rows = custaddrs_df.duplicated().sum()
num_duplicate_rows

0

In [50]:
num_unique_values = custaddrs_df['customer_id'].nunique()
print("Number of unique values in column 'A': ", num_unique_values)

Number of unique values in column 'A':  3999

# Transaction Table

In [38]:
transact_df = pd.read_excel(r"C:\Users\kibe\Downloads\KPMG_VI_New_raw_data_update_final.xlsx", 
                   sheet_name='Transactions')
transact_df.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [39]:
transact_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [41]:
transact_df.sort_values( by="transaction_date",ascending=True,inplace=True)
transact_df['transaction_date'].head(5)

516     2017-01-01
5876    2017-01-01
3459    2017-01-01
12484   2017-01-01
19130   2017-01-01
Name: transaction_date, dtype: datetime64[ns]

In [53]:
num_duplicate_rows = transact_df['customer_id'].duplicated().sum()
num_duplicate_rows

16506

In [52]:
num_unique_values = transact_df['customer_id'].nunique()
print("Number of unique values in column 'A': ", num_unique_values)

Number of unique values in column 'A':  3494

<b>Data Quality Issues</b> The table has missing values in some columns duplicate entries in the customer id column.